{
    "job_id": "REF477A",
    "job_title": "System Integration, Verification & Validation (Junior)",
    "company": {
        "name": "General Dynamics Mission Systems–Canada",
        "description": "At General Dynamics Mission Systems–Canada, we are committed to more than engineering technology solutions—we are dedicated to fostering careers. Our mission is to build a diverse workplace where your beliefs, cultural background, experiences, and ideas are valued and contribute to collective success. Join a community solving critical global problems and working with the brightest engineering minds to drive innovation.",
        "website": ""
    },
    "location": "Calgary, AB, CA",
    "employment_type": "Full-time",
    "job_description": "As a Junior Systems Integration, Verification, and Validation Engineering Analyst on the Mobile Domain team, you will work in a dynamic, Agile environment to ensure our systems meet specifications and transform the Canadian Army's experiences. This on-site role in our Calgary facility involves collaborating in a lab environment to develop test cases, procedures, and methods for system verification tests, innovate using automated test programs, and design/execute validation tests in both lab and field settings. You will configure radios to create test cases or investigate issues and collaborate with customers, software engineers, systems engineers, and management teams in an Integrated Product Team. Work with networking and routing, VLANs, Microsoft applications, radios, voice/data networks, and tools such as Robot Framework, Wireshark, VCCI, CORE, and VBS.",
    "responsibilities": [
        "Develop test cases, procedures, and methods for system verification tests.",
        "Innovate using automated test programs, and design/execute validation tests in both lab and field settings.",
        "Configure radios to create test cases or investigate issues.",
        "Collaborate with customers, software engineers, systems engineers, and management teams in an Integrated Product Team.",
        "Work with networking and routing, VLANs, Microsoft applications, radios, voice/data networks, and tools such as Robot Framework, Wireshark, VCCI, CORE, and VBS."
    ],
    "requirements": [
        "Bachelor’s degree in Systems Engineering, Computer Engineering, Electrical Engineering, or related technical field.",
        "Relevant co-op or internship experience focusing on integration and verification at a system level (design, development, and verification).",
        "Strong problem-solving and root cause analysis skills.",
        "Ability to work both independently and within a team environment.",
        "Interest in learning and working with communication systems and technology.",
        "Eligibility to obtain and maintain Canadian Security Clearance and a positive Controlled Goods Assessment. Must be a Canadian Citizen or Permanent Resident."
    ],
    "benefits": [
        "Flexible Working Environment: Hybrid work model with every other Friday off, promoting work-life balance.",
        "Career Development: Personalized development plans, regular progress reviews, and access to an Educational Assistance Program.",
        "Comprehensive Total Rewards Package: Health and dental coverage, early access to a pension plan, perks to recognize and reward your contributions."
    ],
    "application_instructions": "Apply now to join a workplace where diversity, collaboration, and innovation define our success.",
    "contact_information": {
        "email": "recruitment@gd-ms.ca",
        "phone": "",
        "apply_link": "mailto:recruitment@gd-ms.ca"
    },
    "additional_information": "We embrace diversity, encouraging applications from women, members of the LGBTQ2+ community, individuals from multi-cultural backgrounds, and persons with disabilities. We accommodate workplace needs during the application process. Contact Human Resources at recruitment@gd-ms.ca for assistance."
}
