{
    "job_id": "JR-07392",
    "job_title": "Control Systems Engineer/Analyst",
    "company": {
        "name": "South Bow",
        "description": "At South Bow, we specialize in safely moving oil between some of the world’s most critical markets. We're building a high-performing team with versatile thinkers who thrive on solving big challenges together. If you're ready for a role where your skills are highly valued, and your work is crucial, we want to meet you. Join us in a streamlined energy company dedicated to operational, commercial, and safety excellence in delivering essential energy.",
        "website": "http://SouthBow.com"
    },
    "location": "Calgary, Alberta",
    "employment_type": "Full Time",
    "job_description": "The SCADA team at South Bow is responsible for the integrity of the Supervisory Control and Data Acquisition (SCADA) systems used to monitor and control our pipelines across Canada and the U.S. Working closely with control center, engineering, field operations, and commercial stakeholders, the SCADA team designs, integrates, and maintains reliable and compliant systems to protect assets and the environment, improve operational efficiency, and increase uptime.\n\nThis role is ideal for someone eager to learn pipeline operations, SCADA, and control systems. You should be customer-focused, innovative, and driven to turn ideas into actionable system improvements. As a collaborator and effective communicator, you will bring solutions from ideation to delivery with a bias for action and resilience.",
    "responsibilities": [
        "Translate business requirements into functional requirements for SCADA and control systems.",
        "Develop and conduct factory acceptance tests, site acceptance tests, and commissioning activities.",
        "Manage work assignments under Control Room Management (CRM).",
        "Review and implement integrity plans for SCADA and related real-time systems.",
        "Maintain specifications, procedures, and standards for SCADA systems.",
        "Ensure projects meet standards, timelines, and budget.",
        "Ensure effective transitions into operations and maintain ongoing system sustainability."
    ],
    "requirements": [
        "Bachelor’s degree, certifications, or equivalent experience in computer science, engineering, or a related field.",
        "2+ years of relevant experience.",
        "Strong communication, collaboration, and customer relations skills; organizational and planning skills; ability to manage competing priorities under tight deadlines.",
        "Proven track record in delivering innovative solutions and leading change.",
        "Dedicated to improving the customer experience of delivered solutions."
    ],
    "benefits": [
        "Hybrid work model and flexible dress code for eligible office-based roles."
    ],
    "application_instructions": "Visit us at SouthBow.com for more information, to apply, and to connect with us on our social media channels.",
    "contact_information": {
        "email": "human.resources@southbow.com",
        "phone": "",
        "apply_link": "http://SouthBow.com"
    },
    "additional_information": "Legal authorization to work in the country where the position is based is required. All positions are subject to background screening; some may require criminal and/or credit checks for regulatory compliance. Depending on qualifications, the successful candidate may be offered a position at a different level. Join our talent community to receive new job posting notifications and career opportunities at South Bow."
}
