{
    "job_id": "embedded_system_firmware_engineer_toronto",
    "job_title": "Embedded System Firmware Engineer",
    "company": {
        "name": "indie Semiconductor",
        "description": "indie Semiconductor is driving the Autotech revolution with cutting-edge automotive semiconductors and software platforms. We focus on edge sensors for Advanced Driver Assistance Systems (ADAS), autonomous vehicles, connected car systems, user experiences, and electrification applications.",
        "website": ""
    },
    "location": "Toronto, ON",
    "employment_type": "Full-time",
    "job_description": "As a Software Engineer at indie, you’ll design, implement, and validate software modules for multi-processor systems, collaborate with dynamic teams, and provide technical mentorship in an innovative environment.",
    "responsibilities": [
        "Design, implement, and test system-level firmware features.",
        "Optimize system resources and video data paths for product use cases.",
        "Integrate advanced image and video processing features (e.g., warping, computer vision) developed by algorithm teams.",
        "Develop and maintain device drivers for the AUTOSAR stack.",
        "Integrate indie’s camera processors with system hosts and third-party middleware.",
        "Create and maintain tools for customers and developers.",
        "Support customer system bring-up and troubleshoot issues."
    ],
    "requirements": [
        "Bachelor’s degree in Computer Engineering, Computer Science, or related field.",
        "Proficiency in C programming and debugging in RTOS environments.",
        "Experience with real-time embedded systems, including threading, optimization, memory management, and interrupt handling.",
        "Familiarity with the software development lifecycle.",
        "Knowledge of Python as a scripting language.",
        "Strong analytical and problem-solving skills.",
        "Excellent verbal and written communication skills."
    ],
    "benefits": [
        "Equal opportunity employer",
        "Champion diversity and inclusion",
        "Accommodate applicants’ needs in compliance with applicable laws"
    ],
    "application_instructions": "Apply by sending your resume to the provided email address.",
    "contact_information": {
        "email": "recruitment@indiesemi.com",
        "phone": "",
        "apply_link": "mailto:recruitment@indiesemi.com"
    },
    "additional_information": "indie Semiconductor does not accept unsolicited resumes from agencies and is not responsible for related fees."
}
