{
    "job_id": "R&D_Engineer_II_Ansys_Vancouver",
    "job_title": "R&D Engineer II",
    "company": {
        "name": "Ansys",
        "description": "For over 50 years, Ansys has been enabling innovators to bridge the gap between design and reality through simulation technology. From sustainable transportation to life-saving medical devices, Ansys empowers visionary companies to achieve groundbreaking advancements.",
        "website": "https://www.ansys.com"
    },
    "location": "Vancouver, BC",
    "employment_type": "Full-time",
    "job_description": "The R&D Engineer II contributes to developing software products and supporting systems. In this role, you'll collaborate with expert professionals to understand customer requirements and achieve development objectives. Key focus areas include transforming and componentizing industry-leading Electronics products and integrating them into an emerging Python developer ecosystem.",
    "responsibilities": [
        "Perform moderately complex development activities: Design, implement, maintain, test, and document software modules and subsystems.",
        "Employ and promote best practices in software development.",
        "Conduct bug verification, release testing, and beta support.",
        "Research and resolve issues identified by QA or product support.",
        "Understand product marketing requirements, including target environment, performance criteria, and competitive challenges.",
        "Collaborate under the general supervision of a development manager."
    ],
    "requirements": [
        "BS in Engineering, Computer Science, or a related field with 2 years' experience, or MS.",
        "Working experience with software design and development methodologies.",
        "Proficiency in C++ and at least one other programming language."
    ],
    "benefits": [
        "Innovation: Develop world-changing technology solutions.",
        "Integrity: Act with ethical standards.",
        "Collaboration: Work as ONE Ansys, empowering employees and customers alike.",
        "Diversity & Inclusion: Foster an environment where everyone is valued."
    ],
    "application_instructions": "For more information, visit: www.ansys.com",
    "contact_information": {
        "email": "",
        "phone": "",
        "apply_link": "https://www.ansys.com"
    },
    "additional_information": "Ansys is committed to diversity, equity, and inclusion. All qualified applicants will receive consideration for employment without discrimination based on race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other protected characteristics. Ansys does not accept unsolicited referrals for vacancies. Any unsolicited referral will become the property of Ansys."
}
